mrWheel/radioProject/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions/radio_4mb.csv"
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_FREERTOS_HZ=1000
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=y
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE_DEFAULT_FULL=y
CONFIG_AUDIO_DECODER_MP3_SUPPORT=y
CONFIG_AUDIO_DECODER_AAC_SUPPORT=y
CONFIG_RADIO_ENCODER_REVERSED=n
CONFIG_RADIO_DEFAULT_VOLUME=40
CONFIG_WIFI_PROV_AP_SSID="Internet-Radio-Setup"
CONFIG_WIFI_PROV_AP_PASSWORD=""
CONFIG_WIFI_PROV_PORTAL_TIMEOUT=0
CONFIG_HTTPD_WS_SUPPORT=y

